# Github: GWillS163
# User: 駿清清 
# Date: 17/10/2022 
# Time: 17:38

surveyExlPh1013 = r"D:\work\考核RPA_Exl\Input\2022-9-27\党建表格输入配置表_2022-10-18.xlsx"
surveyExlPh1111 = r"D:\work\考核RPA_Exl\Input\2022-11-11\党建表格输入配置表_2022-11-10.xlsx"
partyAnsExlPh0926 = r"D:\work\考核RPA_Exl\Input\2022-9-27\220926党建工作成效调研测试问卷--党员.xlsx"
peopleAnsExlPh0926 = r"D:\work\考核RPA_Exl\Input\2022-9-27\220926党建工作成效调研测试问卷--群众.xlsx"
partyAnsExlPh1103 = r"D:\work\考核RPA_Exl\Input\2022-11-3\edited\221101党建工作成效调研测试问卷--党员.xlsx"
peopleAnsExlPh1103 = r"D:\work\考核RPA_Exl\Input\2022-11-3\edited\221101党建工作成效调研测试问卷--群众.xlsx"
# partyAnsExlPh = partyAnsExlPh0926
# peopleAnsExlPh = peopleAnsExlPh0926
partyAnsExlPh = partyAnsExlPh1103
peopleAnsExlPh = peopleAnsExlPh1103
surveyExlPh = surveyExlPh1111

isGenDepartments = False

savePath = r"D:\work\考核RPA_Exl\Output"
fileYear = ""
fileName = "PartyBuild"
surveyTestShtName = "测试问卷"
sht1ModuleName = "调研结果_输出模板"
sht2ModuleName = "调研成绩_输出模板"
sht3ModuleName = "调研结果（2022年）_输出模板"
sht4ModuleName = "调研成绩（2022年）_输出模板"
sht1Name = "调研结果"
sht2Name = "调研成绩"
sht3Name = "调研结果（2022年）"
sht4Name = "调研成绩（2022年）"

# Sheet1 生成配置 : F, G
sht1IndexScpFromSht0 = "A1:F31"
sht1TitleCopyFromSttCol = "F"
sht1TitleCopyToSttCol = "G"
# Sheet2 生成配置: "C1:J1", "D"
sht2DeleteCopiedColScp = "C1:J1"
sht2MdlTltStt = "D"
# Sheet3 生成配置:  "L", "J", "K"
sht3MdlTltStt = "L"
sht0SurLastCol = "J"
sht3ResTltStt = "K"  # TODO: 应该可以自动获取

# Sheet4 生成配置:
sht4IndexFromMdl4Scp = 'A4:B52'
sht4TitleFromSht2Scp = 'A1:C17'  # TODO : 应该可以自动获取， 自动识别
sht4SumTitleFromMdlScp = "P1:Q3"

sht1WithLv = {'平台生态部': {'党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0], '二级单位': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0]}, '重要客户中心': {'党建与综合管理室': [8.0, 9.0, 9.0, 9.0, 9.0, 10.0, 8.0, 8.0, 10.0, 10.0, 10.0, 9.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 9.0, 10.0, 9.0, 9.0, 0.0, 10.0, 9.0, 10.0, 9.0, 9.0], '二级单位': [8.0, 9.0, 9.0, 9.0, 9.0, 10.0, 8.0, 8.0, 10.0, 10.0, 10.0, 9.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 9.0, 10.0, 9.0, 9.0, 0.0, 10.0, 9.0, 10.0, 9.0]}, '网络与信息安全中心': {'信安室': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 6.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0], '二级单位': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 6.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0]}, '北京融昱信息技术有限公司': {'党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0, 10.0], '二级单位': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0]}, '信息系统部': {'党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0, 10.0], '二级单位': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0]}, '行政服务中心': {'党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 6.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0, 10.0], '二级单位': [10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, -1.0, 10.0, 6.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 9.0, 10.0]}}


