sta = ''
staAvg = 'sum(sta)/len(sta)'
staAvgUnit = 'staAvg + staAvg'
staffWithLv = {"lv2_0": {"lv3_0": [sta, sta],
                         "lv3_1": [sta, sta]},
               "lv2_1": {"lv3_0": [sta, sta],
                         "lv3_1": [sta, sta]}
               }

scoreWithLv = {'党委办公室（党群工作部、职能管理部党委）': {'党委工作室': [[9, 4, 4, 5, 6, 5, 10, 6, 8, 8, 8, 10, 6, 4, 7, 0, 4, 10, 10, 10, 7, 10, 4, 5, 8, 8, 4, 6, 8, 8]], '职能管理部党委办公室': [[10, 10, 10, 10, 10, 8, 10, 10, 10, 10, 6, 10, 8, 10, 10, 0, 10, 8, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]], '二级单位': [8.033333333333333]}, '巡察工作办公室（党风廉政办公室）': {'主体责任支撑室': [[10, 10, 10, 10, 10, 7, 10, 10, 10, 8, 4, 10, 10, 10, 10, 0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]], '二级单位': [9.3]}, '纪委办公室（职能管理部纪委）': {'综合组织室（职能管理部纪委办公室）': [[10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 0, 4, 10, 10, 10, 10, 10, 10, 10, 10, 10, 8, 10, 10, 10]], '二级单位': [9.4]}}
allOrgCode = {'部门名称': {'departCode': '部门编码', 'level': '级别', 'line': '所属线条', 'parent': '上级部门'}, '公司领导': {'departCode': '200000000', 'level': 1.0, 'line': None, 'parent': '公司领导'}, '综合部': {'departCode': '221010000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '公共关系室': {'departCode': '205010000', 'level': 3.0, 'line': '综合口', 'parent': '综合部'}, '档案管理室': {'departCode': '205040000', 'level': 3.0, 'line': '综合口', 'parent': '综合部'}, '文秘室': {'departCode': '205020000', 'level': 3.0, 'line': '综合口', 'parent': '综合部'}, '发展战略部': {'departCode': '223000000', 'level': 2.0, 'line': '综合口', 'parent': '发展战略部'}, '战略管理室': {'departCode': '223020000', 'level': 3.0, 'line': '综合口', 'parent': '发展战略部'}, '企业管理室': {'departCode': '223060000', 'level': 3.0, 'line': '综合口', 'parent': '发展战略部'}, '法律事务部': {'departCode': '264000000', 'level': 2.0, 'line': '综合口', 'parent': '法律事务部'}, '法务管理室': {'departCode': '264010000', 'level': 3.0, 'line': '综合口', 'parent': '法律事务部'}, '合同管理室': {'departCode': '264020000', 'level': 3.0, 'line': '综合口', 'parent': '法律事务部'}, '外聘法律顾问': {'departCode': '264040000', 'level': 3.0, 'line': '综合口', 'parent': '法律事务部'}, '规划技术部': {'departCode': '211000000', 'level': 2.0, 'line': '网络口', 'parent': '规划技术部'}, '传输及全业务网络室': {'departCode': '211080000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '投资计划室': {'departCode': '211030000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '局房及动力室': {'departCode': '211050000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '移动网络室': {'departCode': '211010000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '业务及支撑网络室': {'departCode': '211040000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '技术演进室': {'departCode': '211090000', 'level': 3.0, 'line': '网络口', 'parent': '规划技术部'}, '5G工作办公室': {'departCode': '279000000', 'level': 2.0, 'line': '市场口', 'parent': '5G工作办公室'}, '财务部': {'departCode': '208000000', 'level': 2.0, 'line': '综合口', 'parent': '财务部'}, '业财管理室': {'departCode': '208030000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '预算考核室': {'departCode': '208010000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '成本效益室': {'departCode': '208080000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '营收保障室': {'departCode': '208060000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '资产增值室': {'departCode': '208070000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '会税管理室': {'departCode': '208040000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '财务支撑室': {'departCode': '208100000', 'level': 3.0, 'line': '综合口', 'parent': '财务部'}, '人力资源部': {'departCode': '207000000', 'level': 2.0, 'line': '综合口', 'parent': '人力资源部'}, '能力发展中心_培训管理室': {'departCode': '207070000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '能力发展中心_培训发展室': {'departCode': '207150000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '薪酬管理室': {'departCode': '207030000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '组织发展室': {'departCode': '207100000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '共享服务中心': {'departCode': '207110000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '员工服务室': {'departCode': '207060000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '干部管理室': {'departCode': '207120000', 'level': 3.0, 'line': '综合口', 'parent': '人力资源部'}, '市场经营部': {'departCode': '210000000', 'level': 2.0, 'line': '市场口', 'parent': '市场经营部'}, '党建与综合管理室': {'departCode': '261010000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '市场研究室': {'departCode': '210120000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '营销策划室': {'departCode': '225330000', 'level': 3.0, 'line': '市场口', 'parent': '政企客户部'}, '业务管理室': {'departCode': '261130000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '业务拓展室': {'departCode': '210240000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '客户运营中心': {'departCode': '210270000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '集中稽核中心_稽核管理室': {'departCode': '210320000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '集中稽核中心_业务稽核中心': {'departCode': '210330000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '集中稽核中心_营收资金稽核中心': {'departCode': '210340000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '集中稽核中心_话费管理中心': {'departCode': '210350000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '终端营销中心': {'departCode': '210380000', 'level': 3.0, 'line': '市场口', 'parent': '市场经营部'}, '客户体验管理部': {'departCode': '224000000', 'level': 2.0, 'line': '市场口', 'parent': '客户体验管理部'}, '个人业务室': {'departCode': '224160000', 'level': 3.0, 'line': '市场口', 'parent': '客户体验管理部'}, '综合支撑室': {'departCode': '224190000', 'level': 3.0, 'line': '市场口', 'parent': '客户体验管理部'}, '体验管理室': {'departCode': '224200000', 'level': 3.0, 'line': '市场口', 'parent': '客户体验管理部'}, '客户协调室': {'departCode': '224180000', 'level': 3.0, 'line': '市场口', 'parent': '客户体验管理部'}, '家企业务室': {'departCode': '224170000', 'level': 3.0, 'line': '市场口', 'parent': '客户体验管理部'}, '网络部': {'departCode': '234090000', 'level': 3.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '网络运营室': {'departCode': '202050000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '网络质量管理室': {'departCode': '202070000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '网络资产管理室': {'departCode': '202040000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '通信保障室': {'departCode': '202020000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '技术合作室': {'departCode': '202030000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '稽核管理室': {'departCode': '202080000', 'level': 3.0, 'line': '网络口', 'parent': '网络部'}, '信息系统部': {'departCode': '201000000', 'level': 2.0, 'line': '市场口', 'parent': '信息系统部'}, '运营维护中心': {'departCode': '201140000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '业务开发中心': {'departCode': '201130000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '服务支撑中心': {'departCode': '201120000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, 'IT支撑中心': {'departCode': '201150000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '大数据支撑中心': {'departCode': '201160000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '中台能力运营部': {'departCode': '201100000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '云基础设施中心': {'departCode': '201110000', 'level': 3.0, 'line': '市场口', 'parent': '信息系统部'}, '供应链管理部': {'departCode': '219000000', 'level': 2.0, 'line': '综合口', 'parent': '供应链管理部'}, '综合管理室': {'departCode': '219030000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '供应链运营管理室': {'departCode': '219010000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '网络与IT产品采购中心': {'departCode': '219070000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '市场与综合产品采购中心': {'departCode': '219080000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '通用产品采购中心': {'departCode': '219090000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '订单中心': {'departCode': '219150000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '物流中心': {'departCode': '219020000', 'level': 3.0, 'line': '综合口', 'parent': '供应链管理部'}, '内审部': {'departCode': '243000000', 'level': 2.0, 'line': '综合口', 'parent': '内审部'}, '综合审计室': {'departCode': '243030000', 'level': 3.0, 'line': '综合口', 'parent': '内审部'}, '业务审计室': {'departCode': '243010000', 'level': 3.0, 'line': '综合口', 'parent': '内审部'}, '党委办公室（党群工作部、职能管理部党委）': {'departCode': '209000000', 'level': 2.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '党委工作室': {'departCode': '209020000', 'level': 3.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '党建工作室': {'departCode': '209040000', 'level': 3.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '企业文化室': {'departCode': '209050000', 'level': 3.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '青年工作室': {'departCode': '209030000', 'level': 3.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '职能管理部党委办公室': {'departCode': '209070000', 'level': 3.0, 'line': '综合口', 'parent': '党委办公室（党群工作部、职能管理部党委）'}, '纪委办公室（职能管理部纪委）': {'departCode': '268000000', 'level': 2.0, 'line': '综合口', 'parent': '纪委办公室（职能管理部纪委）'}, '综合组织室（职能管理部纪委办公室）': {'departCode': '268010000', 'level': 3.0, 'line': '综合口', 'parent': '纪委办公室（职能管理部纪委）'}, '案管审理室': {'departCode': '268020000', 'level': 3.0, 'line': '综合口', 'parent': '纪委办公室（职能管理部纪委）'}, '监督审查一室': {'departCode': '268030000', 'level': 3.0, 'line': '综合口', 'parent': '纪委办公室（职能管理部纪委）'}, '监督审查二室': {'departCode': '268040000', 'level': 3.0, 'line': '综合口', 'parent': '纪委办公室（职能管理部纪委）'}, '巡察工作办公室（党风廉政办公室）': {'departCode': '267000000', 'level': 2.0, 'line': '综合口', 'parent': '巡察工作办公室（党风廉政办公室）'}, '巡察管理室': {'departCode': '267010000', 'level': 3.0, 'line': '综合口', 'parent': '巡察工作办公室（党风廉政办公室）'}, '主体责任支撑室': {'departCode': '267020000', 'level': 3.0, 'line': '综合口', 'parent': '巡察工作办公室（党风廉政办公室）'}, '政企客户部': {'departCode': '225000000', 'level': 2.0, 'line': '市场口', 'parent': '政企客户部'}, '运营管理室': {'departCode': '225010000', 'level': 3.0, 'line': '市场口', 'parent': '政企客户部'}, '合作拓展室': {'departCode': '261170000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '集团客户管理室': {'departCode': '225190000', 'level': 3.0, 'line': '市场口', 'parent': '政企客户部'}, '产品运营中心': {'departCode': '225350000', 'level': 3.0, 'line': '市场口', 'parent': '政企客户部'}, '工程建设部': {'departCode': '206000000', 'level': 2.0, 'line': '网络口', 'parent': '工程建设部'}, '网络工程中心': {'departCode': '206030000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '传输工程中心': {'departCode': '206170000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '区域一室': {'departCode': '206100000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '区域二室': {'departCode': '206010000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '区域三室': {'departCode': '206070000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '区域四室': {'departCode': '206080000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '基建工程中心': {'departCode': '206040000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '工程支撑中心': {'departCode': '206090000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '重点工程中心': {'departCode': '206140000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '工程管理室': {'departCode': '206160000', 'level': 3.0, 'line': '网络口', 'parent': '工程建设部'}, '平台生态部': {'departCode': '239000000', 'level': 2.0, 'line': '市场口', 'parent': '平台生态部'}, '大数据产品中心_产品管理室': {'departCode': '239130000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '大数据产品中心_行业方案室': {'departCode': '239140000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '能力开放中心': {'departCode': '239080000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '产品规划运营中心': {'departCode': '239090000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '视频中心': {'departCode': '239100000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '新产品孵化中心': {'departCode': '239110000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '用户体验运营中心': {'departCode': '239120000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '家庭产品方案运营中心': {'departCode': '239150000', 'level': 3.0, 'line': '市场口', 'parent': '平台生态部'}, '全渠道运营中心': {'departCode': '258000000', 'level': 2.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '渠道发展管理室': {'departCode': '258130000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '自有渠道运营中心': {'departCode': '258140000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '社会渠道运营中心': {'departCode': '258150000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '电子及直销渠道运营中心': {'departCode': '258160000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '渠道生产支撑中心': {'departCode': '258170000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '供应链服务中心': {'departCode': '258180000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '技术开发中心': {'departCode': '258040000', 'level': 3.0, 'line': '市场口', 'parent': '全渠道运营中心'}, '客户服务中心': {'departCode': '212000000', 'level': 2.0, 'line': None, 'parent': '客户服务中心'}, '党群人力部': {'departCode': '212170000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '综合支撑部': {'departCode': '212180000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '服务运营部': {'departCode': '212190000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '市场发展部': {'departCode': '212200000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '服务营销中心': {'departCode': '212210000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '数字化服务支撑团队': {'departCode': '212230000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '政府及央企云客服拓展中心': {'departCode': '212240000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '重点行业云客服拓展中心': {'departCode': '212250000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '服务营销中心全网要客及升级投诉支撑分中心(支撑全网)': {'departCode': '212260000', 'level': 3.0, 'line': None, 'parent': '客户服务中心'}, '数字家庭中心': {'departCode': '276000000', 'level': 2.0, 'line': '市场口', 'parent': '数字家庭中心'}, '经营管理室': {'departCode': '276060000', 'level': 3.0, 'line': '市场口', 'parent': '数字家庭中心'}, '产品营销室': {'departCode': '276020000', 'level': 3.0, 'line': '市场口', 'parent': '数字家庭中心'}, '运营支撑室': {'departCode': '276070000', 'level': 3.0, 'line': '市场口', 'parent': '数字家庭中心'}, '重要客户中心': {'departCode': '244000000', 'level': 2.0, 'line': '市场口', 'parent': '重要客户中心'}, '政府客户中心': {'departCode': '244030000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '互联网客户中心': {'departCode': '244040000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, 'IT与制造业客户中心': {'departCode': '244050000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '金融客户中心': {'departCode': '244060000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '公共事业客户中心': {'departCode': '244070000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '商业及服务业客户中心': {'departCode': '244080000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '医疗客户中心': {'departCode': '244090000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '教育客户中心': {'departCode': '244100000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '方案支撑中心': {'departCode': '244110000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '物联网中心': {'departCode': '244120000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '云业务中心': {'departCode': '244130000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, 'DICT服务保障室': {'departCode': '244140000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '政府客户一中心': {'departCode': '244150000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '政府客户二中心': {'departCode': '244160000', 'level': 3.0, 'line': '市场口', 'parent': '重要客户中心'}, '网络运行管理中心': {'departCode': '271000000', 'level': 2.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '核心网室': {'departCode': '271110000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '技术支援室': {'departCode': '271100000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '互联网运营室': {'departCode': '271010000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '动力及环境室': {'departCode': '271070000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '云业务室': {'departCode': '271200000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '网络能力开放室': {'departCode': '271190000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '电力维护室': {'departCode': '271120000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '网管开发室': {'departCode': '271210000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '网络监控室': {'departCode': '271140000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '资源运营室': {'departCode': '271220000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '质量分析室': {'departCode': '271180000', 'level': 3.0, 'line': '网络口', 'parent': '网络运行管理中心'}, '网络优化中心': {'departCode': '213000000', 'level': 2.0, 'line': '网络口', 'parent': '网络优化中心'}, '党建与综合业务室': {'departCode': '213130000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '网络能力室': {'departCode': '213060000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '业务感知室': {'departCode': '213020000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '东北区域室': {'departCode': '213090000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '东南区域室': {'departCode': '213070000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '应急保障中心': {'departCode': '213140000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '应急通信室': {'departCode': '213050000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '西北区域室': {'departCode': '213100000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '西南区域室': {'departCode': '213080000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '资源维系室': {'departCode': '213110000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '智能优化室': {'departCode': '213190000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '运行维护室': {'departCode': '213180000', 'level': 3.0, 'line': '网络口', 'parent': '网络优化中心'}, '全业务交付运营中心': {'departCode': '275000000', 'level': 2.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '家客交付运营室': {'departCode': '275020000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '集客交付室': {'departCode': '275030000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '集客运营室': {'departCode': '275040000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '承载网维护优化室': {'departCode': '275050000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '云和IDC维护运营室': {'departCode': '275060000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '规划运营室': {'departCode': '275070000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '资源交付室': {'departCode': '275080000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '传输维护优化室': {'departCode': '275090000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '传输系统保障室': {'departCode': '275100000', 'level': 3.0, 'line': '网络口', 'parent': '全业务交付运营中心'}, '网络与信息安全中心': {'departCode': '272000000', 'level': 2.0, 'line': '安全口', 'parent': '网络与信息安全中心'}, '信安室': {'departCode': '272020000', 'level': 3.0, 'line': '安全口', 'parent': '网络与信息安全中心'}, '网安室': {'departCode': '272010000', 'level': 3.0, 'line': '安全口', 'parent': '网络与信息安全中心'}, '安全服务拓展室': {'departCode': '272040000', 'level': 3.0, 'line': '安全口', 'parent': '网络与信息安全中心'}, '行政服务中心': {'departCode': '230000000', 'level': 2.0, 'line': '综合口', 'parent': '行政服务中心'}, '安全保卫室': {'departCode': '230050000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '第一楼宇服务中心': {'departCode': '230060000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '第二楼宇服务中心': {'departCode': '230040000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '第三楼宇服务中心': {'departCode': '230010000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '第四楼宇服务中心': {'departCode': '230100000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '第五楼宇服务中心': {'departCode': '230110000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '后勤管理室': {'departCode': '230020000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '房屋管理室': {'departCode': '230090000', 'level': 3.0, 'line': '综合口', 'parent': '行政服务中心'}, '系统集成运营中心': {'departCode': '256000000', 'level': 2.0, 'line': '市场口', 'parent': '系统集成运营中心'}, '人力资源室': {'departCode': '261020000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '项目集成室': {'departCode': '261080000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '项目交付室': {'departCode': '261140000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '售中开通室': {'departCode': '261120000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '系统运维室': {'departCode': '261150000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '方案咨询室': {'departCode': '261090000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '软件平台室': {'departCode': '261160000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '财务室': {'departCode': '261030000', 'level': 3.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}, '工会': {'departCode': '217000000', 'level': 2.0, 'line': '综合口', 'parent': '工会'}, '权益保障部': {'departCode': '217030000', 'level': 3.0, 'line': '综合口', 'parent': '工会'}, '经济技术部': {'departCode': '217040000', 'level': 3.0, 'line': '综合口', 'parent': '工会'}, '城区一分公司': {'departCode': '237000000', 'level': 2.0, 'line': '一类分公司', 'parent': '城区一分公司'}, '市场部': {'departCode': '234080000', 'level': 3.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '建设中心': {'departCode': '234110000', 'level': 3.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '政企中心': {'departCode': '234100000', 'level': 3.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '望京营销中心': {'departCode': '237110000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区一分公司'}, '全业务支撑中心': {'departCode': '240160000', 'level': 3.0, 'line': '二类分公司', 'parent': '昌平分公司'}, '营销中心': {'departCode': '221160000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '党群纪检部(党委办公室、纪委办公室、党风廉政办公室)': {'departCode': '221190000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '城区二分公司': {'departCode': '232000000', 'level': 2.0, 'line': '一类分公司', 'parent': '城区二分公司'}, '丰台营销中心': {'departCode': '232110000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区二分公司'}, '城区三分公司': {'departCode': '221000000', 'level': 2.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '校园营销中心': {'departCode': '221120000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '门头沟营销中心': {'departCode': '221130000', 'level': 3.0, 'line': '一类分公司', 'parent': '城区三分公司'}, '房山分公司': {'departCode': '233000000', 'level': 2.0, 'line': '二类分公司', 'parent': '房山分公司'}, '党建与综合管理部': {'departCode': '234030000', 'level': 3.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '通州分公司': {'departCode': '236000000', 'level': 2.0, 'line': '二类分公司', 'parent': '通州分公司'}, '顺义分公司': {'departCode': '235000000', 'level': 2.0, 'line': '二类分公司', 'parent': '顺义分公司'}, '大兴分公司': {'departCode': '241000000', 'level': 2.0, 'line': '二类分公司', 'parent': '大兴分公司'}, '亦庄营销中心': {'departCode': '241130000', 'level': 3.0, 'line': '二类分公司', 'parent': '大兴分公司'}, '昌平分公司': {'departCode': '240000000', 'level': 2.0, 'line': '二类分公司', 'parent': '昌平分公司'}, '重点行业拓展中心': {'departCode': '240140000', 'level': 3.0, 'line': '二类分公司', 'parent': '昌平分公司'}, '平谷分公司': {'departCode': '242000000', 'level': 2.0, 'line': '三类分公司', 'parent': '平谷分公司'}, '怀柔分公司': {'departCode': '227000000', 'level': 2.0, 'line': '三类分公司', 'parent': '怀柔分公司'}, '密云分公司': {'departCode': '231000000', 'level': 2.0, 'line': '三类分公司', 'parent': '密云分公司'}, '延庆分公司': {'departCode': '234000000', 'level': 2.0, 'line': '三类分公司', 'parent': '延庆分公司'}, '亦庄区域运营机构筹备组': {'departCode': '245000000', 'level': 2.0, 'line': None, 'parent': None}, '北京融昱信息技术有限公司': {'departCode': '261000000', 'level': 2.0, 'line': None, 'parent': '北京融昱信息技术有限公司'}}

sht1WithLv = {
    '城区一分公司': {
            '建设中心': [9.0, 4.0, 4.0, 0.0, 6.0, 5.0, 10.0, 6.0, 8.0, 8.0, 8.0, 10.0, 6.0, 4.0, 7.0, 0.0, 4.0, 10.0, 10.0,
                     10.0, 7.0, 10.0, 4.0, 5.0, 8.0, 8.0, 4.0, 6.0, 8.0, 8.0],
            '市场部': [10.0, 10.0, 10.0, 0.0, 10.0, 8.0, 10.0, 10.0, 10.0, 10.0, 6.0, 10.0, 8.0, 10.0, 10.0, 0.0,
                    10.0, 8.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0],
            '二级单位': [9.5, 7.0, 7.0, 0.0, 8.0, 6.5, 10.0, 8.0, 9.0, 9.0, 7.0, 10.0, 7.0, 7.0, 8.5, 0.0, 7.0, 9.0, 10.0, 10.0, 8.5, 10.0, 7.0, 7.5, 9.0, 9.0, 7.0, 8.0, 9.0, 9.0]},
    '党委办公室（党群工作部、职能管理部党委）': {
            '党委工作室': [9.0, 4.0, 4.0, 0.0, 6.0, 5.0, 10.0, 6.0, 8.0, 8.0, 8.0, 10.0, 6.0, 4.0, 7.0, 0.0, 4.0, 10.0, 10.0, 10.0, 7.0, 10.0, 4.0, 5.0, 8.0, 8.0, 4.0, 6.0, 8.0, 8.0],
            '职能管理部党委办公室': [10.0, 10.0, 10.0, 0.0, 10.0, 8.0, 10.0, 10.0, 10.0, 10.0, 6.0, 10.0, 8.0, 10.0, 10.0, 0.0, 10.0, 8.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0],
            '二级单位': [9.5, 7.0, 7.0, 0.0, 8.0, 6.5, 10.0, 8.0, 9.0, 9.0, 7.0, 10.0, 7.0, 7.0, 8.5, 0.0, 7.0, 9.0, 10.0, 10.0, 8.5, 10.0, 7.0, 7.5, 9.0, 9.0, 7.0, 8.0, 9.0, 9.0]},
    '巡察工作办公室（党风廉政办公室）': {
            '主体责任支撑室': [10.0, 10.0, 10.0, 0.0, 10.0, 7.0, 10.0, 10.0, 10.0, 8.0, 4.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0],
            '二级单位': [10.0, 10.0, 10.0, 0.0, 10.0, 7.0, 10.0, 10.0, 10.0, 8.0, 4.0, 10.0, 10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0]},
    '纪委办公室（职能管理部纪委）': {
            '综合组织室（职能管理部纪委办公室）': [10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 4.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 8.0, 10.0, 10.0, 10.0],
            '二级单位': [10.0, 10.0, 10.0, 0.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 0.0, 4.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 8.0, 10.0, 10.0, 10.0]}}


# 用的时候 需要 * weight
sht2WithLv = {"lv2_0": {"lv3_0": [staAvgUnit],
                        "lv3_1": [staAvgUnit],
                        "二级单位成绩": [],
                        "本线条排名": [],
                        "全公司排名": [],
                        },
              }


sht3WithLv = {"lv2_0": {"lv3_0": [staAvgUnit],}}




# 姓名 二级部门名称 二级部门编码 三级部门名称 三级部门编码 4A账号
partyQuestLst = ['1.【评分题】请对您所在二级单位党组织2022年度党建工作在提质量方面的成效进行评价。', '2.【评分题】请对您所在二级单位党组织2022年度党建工作在促融合方面的成效进行评价。',
                 '3.【评分题】请对您所在二级单位党组织2022年度党建工作在扩成效方面的成效进行评价。',
                 '4.【评分题】请您对所在的二级单位党组织学习贯彻落实习近平总书记、党中央及上级党组织重要决策部署的成效进行评价。',
                 '5.【评分题】请您对公司推进作风建设与能力提升专项行动以来的成效进行评价。【此题不计分，仅用作调研】',
                 '6.【不定项选择题】您所在的二级单位党组织在落实中国移动党建领域发现有关问题对照自查整改工作后，党建工作有哪些改善？',
                 '7.【评分题】请对您所在的二级单位在“四个转化”和“两个一以贯之”的落实效果进行评价。', '8.【评分题】请对您所在的二级单位党组织书记委员在发挥示范引领作用方面的表现进行评价。',
                 '9.【不定项选择题】您所在的二级单位开展了以下哪些宣传活动？', '10.【不定项选择题】请对您所在二级单位的网格在改革运营从“100%开展”向“100%深化”优化升级方面的工作取得了哪些成效？',
                 '11.【不定项选择题】您所在二级单位党组织通过“两和”3.0在“四个推广一批”方面取得了哪些成效？', '12.【评分题】请对您所在二级单位党组织在开展“两和”主题实践活动升级的成效进行评价。',
                 '13.【不定项选择题】您所在二级单位党组织“三级联系点”机制与下列哪些描述相符。', '14.【不定项选择题】您认为您所在二级单位党组织开展“党建和创”主题实践活动在“拓规模”方面取得了哪些成效？',
                 '15.【不定项选择题】您认为您所在二级单位党组织开展的“五G党建赋能5G争先”活动取得了以下哪些成效？',
                 '16.【不定项选择题】您所在二级单位党组织在开展党员教育培训（例如“三会一课”、主题党日、党史学习教育等）方面的表现，与下列哪些描述相符？',
                 '17.【不定项选择题】您所在二级单位党组织的新选举出的党务工作者在履职尽责方面的表现，与下列哪些描述相符？', '18.【不定项选择题】在您看来，您所在二级单位党组织发展党员工作，与下列哪项描述相符？',
                 '19.【不定项选择题】请您对所在二级单位开展“青年素养提升工程”的成效进行评价。【本题由各级党组织委员、35岁以下青年（含团干部）作答】',
                 '20.【评分题】请您对您所在二级单位团组织作用发挥情况进行打分。【本题由35岁以下青年（含团干部）作答】',
                 '21.【不定项选择题】您所在二级单位团组织开展了哪些宣传工作？【本题由35岁以下青年（含团干部）作答】', '22.【评分题】请对您所在二级单位党组织在日常工作中发挥战斗堡垒作用的情况进行评价。',
                 '23.【评分题】请对您所在二级单位党员在日常工作中发挥先锋模范作用的情况进行评价。',
                 '24.【开放题】在您看来，您所在二级单位党组织还有哪些需要提升之处？还需要上级党组织给予哪些支持和指导？【此题不计分，仅用作调研】', '25.【不定项选择题】您所在的二级单位开展了以下哪些宣传活动？',
                 '26.【单选题】您所在二级单位内部开展宣传及时有效，形式新颖、有趣，令人印象深刻，能够对部门及自身工作开展起到推动作用。', '27.【单选题】您所在二级单位内部开展评先评优的频次为？',
                 '28.【单选题】您所在的二级单位形成了良好的文化氛围。',
                 '29.【评分题】请您对所在二级单位在开展党风廉政教育，围绕“担责任、树清风、办实事”主题开展反腐倡廉教育月集中学习活动的成效进行评价。【此题不计分，仅用作调研】',
                 '30.【单选题】请对您所在的二级单位反腐倡廉教育月活动整体成效进行评价。【此题不计分，仅用作调研】',
                 '31.【评分题】请对您所在的二级单位在坚持创新形式、分层分级开展日常教育宣传和警示教育活动的整体成效进行评价。【此题不计分，仅用作调研】',
                 '32.【评分题】您所在的二级单位是否就往期巡视巡察发现问题及北京公司通报的巡察共性问题开展对照自查及整改工作，坚持举一反三，防止“查而不纠”，确保整改落实到位？【此题不计分，仅用作调研】',
                 '33.【评分题】请您对所在二级单位强化思想和岗位嵌入方面取得的成效进行评价。【此题不计分，仅用作调研】',
                 '34.【评分题】请您对所在二级单位不断提升风险防控的制度、流程保障方面取得的成效进行评价。【此题不计分，仅用作调研】',
                 '35.【单选题】您是否了解本单位整治整改全面提升工作情况？【此题不计分，仅用作调研】', '36.【评分题】请您对所在二级单位整治整改全面提升工作的成效进行评价。【此题不计分，仅用作调研】',
                 '37.【不定项选择题】您所在的二级单位开展廉洁宣传活动上取得了哪些成效？【此题不计分，仅用作调研】', '38.【评分题】请您对所在二级单位加强作风建设的整体情况进行评价。【此题不计分，仅用作调研】',
                 '39.【评分题】请您对所在二级单位防范“四风”问题的整体情况进行评价。【此题不计分，仅用作调研】', '40.【评分题】请您对所在二级单位领导干部的作风形象进行评价。【此题不计分，仅用作调研】',
                 '41.【评分题】请您对所在二级单位落实八项规定精神的情况进行评价。【此题不计分，仅用作调研】', '42.【评分题】您所在二级单位是否积极部署落实监督责任？【此题不计分，仅用作调研】',
                 '43.【评分题】请您对所在二级单位在监督推动重要决策部署落实情况进行评价。【此题不计分，仅用作调研】',
                 '44.【评分题】请您对所在的二级单位纪检队伍常态化开展廉洁教育，持续深化警示教育，提升宣传广度深度，积极营造守纪律、讲规矩的风清气正良好氛围。【此题不计分，仅用作调研】',
                 '45.【开放题】感谢您配合完成本次测试工作！您对2022年度党建工作成效调研工作（包括但不限于调研系统、调研问卷）有何意见与建议？欢迎填写反馈，再次感谢！']
sht1WithLvParty = {'平台生态部': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '网络与信息安全中心': {
    '信安室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
            0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
            0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '北京融昱信息技术有限公司': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '信息系统部': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '行政服务中心': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '城区二分公司': {
    '党群纪检部(党委办公室、纪委办公室、党风廉政办公室)': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '网络优化中心': {
    '党建与综合业务室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '客户体验管理部': {
    '综合支撑室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '延庆分公司': {
    '市场部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
            0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
            0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '市场经营部': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]},
    '内审部': {
    '综合审计室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '巡察工作办公室（党风廉政办公室）': {
    '巡察管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '主体责任支撑室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '大兴分公司': {
    '党建与综合管理部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '党委办公室（党群工作部、职能管理部党委）': {
    '党委工作室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '党建工作室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '企业文化室': [10.0, 1.0, 5.0, 6.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0],
    '二级单位': [10.0, 7.0, 8.333333333333334, 8.666666666666666, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '全业务交付运营中心': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '昌平分公司': {
    '党建与综合管理部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '城区三分公司': {
    '党群纪检部(党委办公室、纪委办公室、党风廉政办公室)': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '密云分公司': {
    '党建与综合管理部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '房山分公司': {
    '党建与综合管理部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '数字家庭中心': {
    '运营支撑室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '网络部': {
    '稽核管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '工程建设部': {
    '业务管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '发展战略部': {
    '企业管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '供应链管理部': {
    '综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}, '纪委办公室（职能管理部纪委）': {
    '监督审查一室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
               0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
               0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0]}}
# scoreExlTitle: 姓名 二级部门名称 二级部门编码 三级部门名称 三级部门编码 4A账号
peopleQuestLst = ['1.【评分题】请对您所在二级单位党组织2022年度党建工作在提质量方面的成效进行评价。', '2.【评分题】请对您所在二级单位党组织2022年度党建工作在促融合方面的成效进行评价。',
                  '3.【评分题】请对您所在二级单位党组织2022年度党建工作在扩成效方面的成效进行评价。',
                  '4.【评分题】请您对所在的二级单位党组织学习贯彻落实习近平总书记、党中央及上级党组织重要决策部署的成效进行评价。',
                  '5.【评分题】请您对公司推进作风建设与能力提升专项行动以来的成效进行评价。【此题不计分，仅用作调研】',
                  '6.【不定项选择题】您所在的二级单位党组织在落实中国移动党建领域发现有关问题对照自查整改工作后，党建工作有哪些改善？',
                  '7.【评分题】请对您所在的二级单位在“四个转化”和“两个一以贯之”的落实效果进行评价。', '8.【评分题】请对您所在的二级单位党组织书记委员在发挥示范引领作用方面的表现进行评价。',
                  '9.【不定项选择题】您所在的二级单位开展了以下哪些宣传活动？', '10.【不定项选择题】请对您所在二级单位的网格在改革运营从“100%开展”向“100%深化”优化升级方面的工作取得了哪些成效？',
                  '11.【不定项选择题】您所在二级单位党组织通过“两和”3.0在“四个推广一批”方面取得了哪些成效？', '12.【评分题】请对您所在二级单位党组织在开展“两和”主题实践活动升级的成效进行评价。',
                  '13.【不定项选择题】您所在二级单位党组织“三级联系点”机制与下列哪些描述相符。', '14.【不定项选择题】您认为您所在二级单位党组织开展“党建和创”主题实践活动在“拓规模”方面取得了哪些成效？',
                  '15.【不定项选择题】您认为您所在二级单位党组织开展的“五G党建赋能5G争先”活动取得了以下哪些成效？',
                  '16.【不定项选择题】您所在二级单位党组织在开展党员教育培训（例如“三会一课”、主题党日、党史学习教育等）方面的表现，与下列哪些描述相符？',
                  '17.【不定项选择题】您所在二级单位党组织的新选举出的党务工作者在履职尽责方面的表现，与下列哪些描述相符？',
                  '18.【不定项选择题】在您看来，您所在二级单位党组织发展党员工作，与下列哪项描述相符？',
                  '19.【不定项选择题】请您对所在二级单位开展“青年素养提升工程”的成效进行评价。【本题由各级党组织委员、35岁以下青年（含团干部）作答】',
                  '20.【评分题】请您对您所在二级单位团组织作用发挥情况进行打分。【本题由35岁以下青年（含团干部）作答】',
                  '21.【不定项选择题】您所在二级单位团组织开展了哪些宣传工作？【本题由35岁以下青年（含团干部）作答】', '22.【评分题】请对您所在二级单位党组织在日常工作中发挥战斗堡垒作用的情况进行评价。',
                  '23.【评分题】请对您所在二级单位党员在日常工作中发挥先锋模范作用的情况进行评价。',
                  '24.【开放题】在您看来，您所在二级单位党组织还有哪些需要提升之处？还需要上级党组织给予哪些支持和指导？【此题不计分，仅用作调研】',
                  '25.【不定项选择题】您所在的二级单位开展了以下哪些宣传活动？', '26.【单选题】您所在二级单位内部开展宣传及时有效，形式新颖、有趣，令人印象深刻，能够对部门及自身工作开展起到推动作用。',
                  '27.【单选题】您所在二级单位内部开展评先评优的频次为？', '28.【单选题】您所在的二级单位形成了良好的文化氛围。',
                  '29.【评分题】请您对所在二级单位在开展党风廉政教育，围绕“担责任、树清风、办实事”主题开展反腐倡廉教育月集中学习活动的成效进行评价。【此题不计分，仅用作调研】',
                  '30.【单选题】请对您所在的二级单位反腐倡廉教育月活动整体成效进行评价。【此题不计分，仅用作调研】',
                  '31.【评分题】请对您所在的二级单位在坚持创新形式、分层分级开展日常教育宣传和警示教育活动的整体成效进行评价。【此题不计分，仅用作调研】',
                  '32.【评分题】您所在的二级单位是否就往期巡视巡察发现问题及北京公司通报的巡察共性问题开展对照自查及整改工作，坚持举一反三，防止“查而不纠”，确保整改落实到位？【此题不计分，仅用作调研】',
                  '33.【评分题】请您对所在二级单位强化思想和岗位嵌入方面取得的成效进行评价。【此题不计分，仅用作调研】',
                  '34.【评分题】请您对所在二级单位不断提升风险防控的制度、流程保障方面取得的成效进行评价。【此题不计分，仅用作调研】',
                  '35.【单选题】您是否了解本单位整治整改全面提升工作情况？【此题不计分，仅用作调研】', '36.【评分题】请您对所在二级单位整治整改全面提升工作的成效进行评价。【此题不计分，仅用作调研】',
                  '37.【不定项选择题】您所在的二级单位开展廉洁宣传活动上取得了哪些成效？【此题不计分，仅用作调研】', '38.【评分题】请您对所在二级单位加强作风建设的整体情况进行评价。【此题不计分，仅用作调研】',
                  '39.【评分题】请您对所在二级单位防范“四风”问题的整体情况进行评价。【此题不计分，仅用作调研】', '40.【评分题】请您对所在二级单位领导干部的作风形象进行评价。【此题不计分，仅用作调研】',
                  '41.【评分题】请您对所在二级单位落实八项规定精神的情况进行评价。【此题不计分，仅用作调研】', '42.【评分题】您所在二级单位是否积极部署落实监督责任？【此题不计分，仅用作调研】',
                  '43.【评分题】请您对所在二级单位在监督推动重要决策部署落实情况进行评价。【此题不计分，仅用作调研】',
                  '44.【评分题】请您对所在的二级单位纪检队伍常态化开展廉洁教育，持续深化警示教育，提升宣传广度深度，积极营造守纪律、讲规矩的风清气正良好氛围。【此题不计分，仅用作调研】',
                  '45.【开放题】感谢您配合完成本次测试工作！您对2022年度党建工作成效调研工作（包括但不限于调研系统、调研问卷）有何意见与建议？欢迎填写反馈，再次感谢！']

sht1WithLvPeople = {'客户体验管理部': {
    '家企业务室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
              0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '顺义分公司': {
    '党建与综合管理部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '系统集成运营中心': {
    '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
             0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]},
                    '巡察工作办公室（党风廉政办公室）': {
                        '主体责任支撑室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                    0.0, 0.0, 0.0, 0.0],
                        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0]}, '市场经营部': {
        '党建与综合管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                     0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '网络与信息安全中心': {
        '信安室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '昌平分公司': {
        '政企中心': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '内审部': {
        '综合审计室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]},
                    '党委办公室（党群工作部、职能管理部党委）': {
                        '党建工作室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0],
                        '党委工作室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0],
                        '青年工作室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                  0.0, 0.0, 0.0, 0.0],
                        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0]}, '大兴分公司': {
        '市场部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '发展战略部': {
        '战略管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]},
                    '纪委办公室（职能管理部纪委）': {
                        '监督审查一室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0],
                        '监督审查二室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                   0.0, 0.0, 0.0, 0.0],
                        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                                 0.0, 0.0, 0.0, 0.0]}, '行政服务中心': {
        '第二楼宇服务中心': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                     0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '城区三分公司': {
        '综合部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '综合部': {
        '档案管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '财务部': {
        '成本效益室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '密云分公司': {
        '市场部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '供应链管理部': {
        '供应链运营管理室': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                     0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '通州分公司': {
        '市场部': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        '二级单位': [10.0, 10.0, 10.0, 10.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
                 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}

result = {'客户体验管理部': {'家企业务室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '综合支撑室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '顺义分公司': {'党建与综合管理部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '系统集成运营中心': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '巡察工作办公室（党风廉政办公室）': {'主体责任支撑室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '巡察管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '市场经营部': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '网络与信息安全中心': {'信安室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '昌平分公司': {'政企中心': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党建与综合管理部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '内审部': {'综合审计室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '党委办公室（党群工作部、职能管理部党委）': {'党建工作室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党委工作室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '青年工作室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '企业文化室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '大兴分公司': {'市场部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党建与综合管理部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '发展战略部': {'战略管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '企业管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '纪委办公室（职能管理部纪委）': {'监督审查一室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '监督审查二室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '行政服务中心': {'第二楼宇服务中心': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '城区三分公司': {'综合部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党群纪检部(党委办公室、纪委办公室、党风廉政办公室)': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '综合部': {'档案管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '财务部': {'成本效益室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '密云分公司': {'市场部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '党建与综合管理部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '供应链管理部': {'供应链运营管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '通州分公司': {'市场部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '平台生态部': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '北京融昱信息技术有限公司': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '信息系统部': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '城区二分公司': {'党群纪检部(党委办公室、纪委办公室、党风廉政办公室)': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '网络优化中心': {'党建与综合业务室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '延庆分公司': {'市场部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '全业务交付运营中心': {'党建与综合管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '房山分公司': {'党建与综合管理部': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '数字家庭中心': {'运营支撑室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '网络部': {'稽核管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}, '工程建设部': {'业务管理室': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], '二级单位': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}

quesLst = ['请对您所在二级单位党组织在2021年抓实党建质量提升方面的成效进行评价：', '您所在二级单位党组织在开展党员教育培训（例如“三会一课”、主题党日、党史学习教育等）方面的表现，与下列哪些描述相符？',
       '您认为您所在的二级单位党组织在开展“学党史”“悟思想”“办实事”“开新局”四个方面取得了哪些成效？', '请您对公司党委推进“我为群众办实事”主题实践活动的成效进行评价【此题不计分，仅用作调研】：\n',
       '在全国国有企业党建工作会议召开5周年之际，您认为您所在的二级单位在党建工作方面的提升大吗？', '请对您所在的二级单位“两个一以贯之”的落实效果进行评价：',
       '您所在的二级单位党组织在落实中国移动2021年党建领域发现有关问题对照自查整改工作后，党建工作有哪些改善？', '请对您所在的二级单位党组织在三基建设方面的成效进行评价：',
       '您所在二级单位党组织的书记委员在发挥示范引领作用方面的表现，与下列哪些描述相符？', '您所在二级单位党组织的党务工作者在履职尽责方面的表现，与下列哪些描述相符？',
       '您所在二级单位的党员在您心目中的形象，与下列哪些描述相符？', '您所在二级单位的网格在组织覆盖从“有形覆盖”向“有效覆盖”优化升级方面的表现，与下列哪些描述相符？',
       '请问您所在二级单位“三级联系点”机制与下列哪些描述相符？', '请对您所在二级单位党组织在日常工作中发挥战斗堡垒作用的情况进行评价。', '请对您所在二级单位党员在日常工作中发挥先锋模范作用的情况进行评价。',
       '在您看来，您所在二级单位党组织在抓实党建质量提升和抓实党业深度融合方面还需哪些提升？还需要上级党组织给予哪些支持和指导？', '您所在的二级单位开展了以下哪些宣传活动？（至少选三项）',
       '您所在二级单位内部开展宣传及时有效，形式新颖、有趣，令人印象深刻，能够对部门及自身工作开展起到推动作用。', '您所在二级单位内部开展典型选树宣传活动的频次为？',
       '您认为您所在的二级单位在文化氛围建设方面是否形成了“创新、求实、协作、争先”的氛围？即注重不断创新，'
       '鼓励员工开拓进取，在工作方法等方面进行创新，不断取得更好的成绩；在工作中真抓实干，关注察实情、办实事、下实功、求实效；'
       '倡导工作上向前跨一步，相互补位，共同寻找杠杆解；注重培育团队和团队成员的争先意识和开拓精神，在前进中战胜一切困难，完成自我超越 ',
           '请您对所在二级单位在开展党风廉政教育，围绕“担责任、树清风、办实事”主题开展反腐倡廉教育月集中学习活动的成效进行评价：', '请对您所在的二级单位在坚持创新形式、分层分级开展日常教育宣传和警示教育活动的整体成效进行评价：',
           '您所在的二级单位是否就往期巡视巡察发现问题及北京公司通报的巡察共性问题开展对照自查及整改工作，坚持举一反三，防止“查而不纠”，确保整改落实到位？',
           '请您对所在二级单位在嵌入式廉洁风险防控思想嵌入和岗位嵌入方面，以嵌入式防控手册中的廉洁风险场景为基础，开展形式多样的教育培训，'
       '注重提升员工对自身承载风险点、风险场景、防控举措等方面内容的认识，提高廉洁风险防范意识，强化思想和岗位嵌入方面取得的成效。',
           '请您对所在二级单位在嵌入式廉洁风险防控制度嵌入和流程嵌入方面，'
       '加强嵌入式廉洁风险防控与制度、流程优化的联动，将切实有效的嵌入式防控措施纳入制度和流程中进行固化，推动风险防控与各业务领域工作有效衔接，不断提升风险防控的制度、流程保障方面取得的成效。',
           '您所在二级单位今年是否常态化开展廉洁教育、纪律教育和警示教育活动，例如学习党章党纪党规及公司相关规定，开展案例警示教育，组织知识答题互动等？请根据您的印象选择2021年度开展警示教育次数。',
           '您所在的二级单位开展廉洁宣传活动上取得了哪些成效？', '在监督推动深化整治“靠企吃企”问题工作方面，您所在二级单位是否部署落实监督责任，强化政治监督，主动发现和解决问题，形成监督与接受监督的浓厚氛围与良好习惯？',
           '请问在您看来，您所在二级单位经理人员是否存在违规收送礼品礼金、电子红包或其他违规情况现象？', '请您从政治站位、斗争精神、能力素质、作风形象对您所在的二级单位纪检队伍履职情况进行打分。', None]
